import * as Yup from 'yup'

const validationSchema = [
  Yup.object().shape({
    title: Yup.string()
      .required('Поле є обов\'язковим')
      .min(2, 'Довжина поля не менше як 5 символів')
      .max(50, 'Довжина поля не більше як 150 символів'),
    images: Yup.array()
      .required('Поле є обов\'язковим')
      .min(1, 'Мінімальна кількість 1 файл для продукту')
      .max(5, 'Максимальна кількість 5 файлів для продукту')
      .test({
        message: 'Додайте один або більше файлів!',
        test: arr => arr.length > 0
      })
  }),
  Yup.object().shape({
    width: Yup.number()
      .required('Поле є обов\'язковим')
      .integer('Допустимі тільки цілі числа')
      .positive('Доступні тільки додатні числа')
      .min(1, 'Недопустиме мінімальне значення поля')
      .max(9999, 'Недопустиме максимальне значення поля'),
    height: Yup.number()
      .required('Поле є обов\'язковим')
      .integer('Допустимі тільки цілі числа')
      .positive('Доступні тільки додатні числа')
      .min(1, 'Недопустиме мінімальне значення поля')
      .max(9999, 'Недопустиме максимальне значення поля'),
    thickness: Yup.number()
      .required('Поле є обов\'язковим')
      .integer('Допустимі тільки цілі числа')
      .positive('Доступні тільки додатні числа')
      .min(1, 'Недопустиме мінімальне значення поля')
      .max(9999, 'Недопустиме максимальне значення поля'),
    weight: Yup.number()
      .required('Поле є обов\'язковим')
      .integer('Допустимі тільки цілі числа')
      .positive('Доступні тільки додатні числа')
      .min(1, 'Недопустиме мінімальне значення поля')
      .max(9999, 'Недопустиме максимальне значення поля'),
    quantity: Yup.number()
      .required('Поле є обов\'язковим')
      .integer('Допустимі тільки цілі числа')
      .positive('Доступні тільки додатні числа')
      .min(1, 'Недопустиме мінімальне значення поля')
      .max(9999, 'Недопустиме максимальне значення поля'),
  }),
  Yup.object().shape({
    prices: Yup.object({
      color: Yup.string()
        .required('Поле є обов\'язковим')
        .max(25, 'Довжина поля не більше як 50 символів'),
      price: Yup.number()
        .required('Поле є обов\'язковим')
        .integer('Допустимі тільки цілі числа')
        .positive('Доступні тільки додатні числа')
        .min(1, 'Недопустиме мінімальне значення поля')
        .max(9999, 'Недопустиме максимальне значення поля'),
    })
  }),
]

export default validationSchema